Student name: Diana Ngeta
Student pace: Part Time
Cohort: DSF-PT-07
Scheduled project review date: 3rd June 2024
Instructor name:Samuel Karu / Sam G Mwangi / Winnie Onyoso

PROBLEM STATEMENT

Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they donâ€™t know anything about creating movies. 
I have been charged with exploring what types of films are currently doing the best at the box office and must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

DATA SOURCE
The data used in this analysis is from the folder zippedData which had movie datasets from the following sources:
Box Office Mojo, IMDB, Rotten Tomatoes, The Mobie DB and The Numbers

In [2]:
import pandas as pd
import csv
import json
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3

EDA
DATA SOURCE
The data used in this analysis is from the folder zippedData which had movie datasets from the following sources:
Box Office Mojo, IMDB, Rotten Tomatoes, The Mobie DB and The Numbers

In [5]:
# Loading Bom Movie dataset

f = r"C:\Users\DIANA\OneDrive\Desktop\Projects\dsc-phase-1-project-v2-4\zippedData\bom.movie_gross.csv.gz"
df1 = pd.read_csv(f)
df1.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

In [6]:
# renaming title column in df1 to primary_title to ease the merging

df1.rename(columns={'title' : 'primary_title'}, inplace = True)
print(df1.columns)

Index(['primary_title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [2]:
import pandas as pd

In [9]:
f = r"C:\Users\DIANA\OneDrive\Desktop\Projects\dsc-phase-1-project-v2-4\zippedData\tmdb.movies.csv.gz"
df5 = pd.read_csv(f)
df5.head(5)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [10]:
df5.rename(columns={'original_title' : 'primary_title'}, inplace = True)
print(df5.columns)

Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'primary_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [11]:
f = r"C:\Users\DIANA\OneDrive\Desktop\Projects\dsc-phase-1-project-v2-4\zippedData\tn.movie_budgets.csv.gz"
df6 = pd.read_csv(f)
df6.head(6)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"

In [12]:
df6.rename(columns={'movie' : 'primary_title'}, inplace = True)
print(df6.columns)

Index(['id', 'release_date', 'primary_title', 'production_budget',
       'domestic_gross', 'worldwide_gross'],
      dtype='object')